/*
	Создание объектов, связанных с отчётными периодами
*/


/*======================================================*/
--справочник, хранит расчётные периоды
--будет использоваться в PL (точно, т.к. отчёт за период), BS -возможно (по закрытым периодам)
--возможно где-то ещё
drop table if exists Accounting.dic_period;
CREATE table Accounting.dic_period
(
        id_period int not null primary key clustered
    ,   left_margin date
    ,   right_margin date
    ,   [description] nvarchar(1024)
    ,   create_date datetime not null default getdate()

)
--первичное заполнение (предусмотрен задел на предыдущие периоды)
--очистка при ошибках первичного наполнения
--truncate table Accounting.dic_period ;

insert into Accounting.dic_period 
(id_period, left_margin, right_margin, [description] )
values 
(100, '2026-01-01', '2026-01-30', 'январь 2026'),
(101, '2026-02-01', '2026-02-28', 'февраль 2026'),
(102, '2026-03-01', '2026-03-31', 'март 2026'),
(103, '2026-04-01', '2026-04-30', 'апрель 2026'),
(104, '2026-05-01', '2026-05-31', 'май 2026'),
(105, '2026-06-01', '2026-06-30', 'июнь 2026'),
(106, '2026-07-01', '2026-07-31', 'июль 2026')
--(107, '2026-08-01', '2026-06-30', 'июнь 2026')
--(108, '2026-09-01', '2026-06-30', 'июнь 2026')


--тест
--select top 100 * from Accounting.dic_period
