/*  Таблицы схемы STAGE
*/
--Схема STAGE
--на текущий момент реализована в объёме MVP
/*
    Наименование: буферна таблица загрузки приходно/расходных операций
    Бизнес-ограничения: загрузка должна включать все операции за рассматриваемый период
        иначе расчётные процедуры сгенерируют некорректный результат
        решено отказаться от схемы дебет-кредит для этапа MVP по причине: подобное деление оправдано при загрузке агрегированных данных (когда по счёту шло движение и по дебету и по кредиту), что в нашем случае не используется

    операционные свойства:
        неиндексируемая (буфер?)
        не имеет первичного ключа (нет смысла)
        очищаемая после обработки
        не допускает NULL (для упрощения процедур)
        не содержит внешних ключей (иначе будет ужас при загрузке),
            ошибки проверяются процедурами-обработчиками при подготовке данных для передачи на расчётный слой
*/
USE PersonalFinance_v4

DROP table IF EXISTS STAGE.BUF_FCT_CARRY;
/*
    Таблица входящего буфера, загружаемая из excel или вручную
    является источником данных для загрузки в основную таблицу проводок
    После обработки - должен быть выполнен truncate (на этапе отладки - вручную)
    Основной принцип:
        таблица включает все данные за период
        таблица включает финально верифицированные данные (т.е. существующие в системе будут исправлены)

*/

CREATE TABLE STAGE.BUF_FCT_CARRY
(
      CARRY_DATE        DATETIME2       NOT NULL--дата проводки (в реальности используется формат DATE)
    , TURNOVER_SUM      NUMERIC(28,12)  NOT NULL--суммарный оборот, фактически - сумма проводки, точность для HomeFinance запредельная
    , account_name      NVARCHAR(1024)  NOT NULL--наименование счёта (для банковских счетов - 20-начный номер)
    , client_name       nvarchar(1024) NOT NULL -- Наименование клиента
    , agreement_name	NVARCHAR(1024)  NOT NULL--номер договора (для карт может быть наименование карты)
    , carry_ground      NVARCHAR(1024)  NOT NULL--основание платежа / описание / номера чеков, договоров для дальнейшей детализации (где применимо)
    , carry_category    nvarchar(1024)  --может быть пустым, регистронезависимый, уточняющая расчётная категория (вида "подарки", "регулярные расходы", и т.п., работает в связке в сектором)
    , carry_sertor      nvarchar(1024) --может быть пустым, регистронезависимый, операционный сектор (вида "еда", "транспорт", "авто", "топливо")
    , bal2              NVARCHAR(512)   --(может быть не заполнено) балансовый счёт (для категорирования данных), полезно при отутствии внятных наименований счёта
    , extra_data        NVARCHAR(1024)  NOT NULL --дополнительные признаки вида peoperty_name=value разделитель ";" разбор отдельной процедурой
)


--заполнение данными
/*
уровни категорирования (исключить балансовые счета, ввести категории)
    Расчётная категория (наличка, карты, кредиты и т.п.)
    Операционный сектор (еда, авто, подарки и т.п.)
Маркеры поразрядные, структурированные (первичная структуризация, чтобы пользователь ориентировался) или слова?
предусмотреть 2 уровня классификации, третий пока излишен

матрица категоризации для разметки баланса и ОПУ...
категории ОПУ - на проводки
категории баланса... ??? на каком этапе?


*/
