/*
	Проект: База данных для управления личными финансами
	Этап проекта: 
		1. создание базы данных
		2. Создание базовых таблиц проекта
		2.1 Создание первичных ключей
		2.2 Учёт ограничений полей
		2.3 Создание индексов

	Разнесенине по файлам:
	- создание базы
	- создание схем, таблиц в схемах, создание индексов для таблиц

	- процедуры и функции по отдельным файлам

    Оценка объёма:
        до 1 тыс.строк мес. входящих данных = 28 Мб.максимум (если заполнены все поля по-максимуму), 
            в реальности - записей на порядок меньше, заполнение полей около 10-20%
        при обработке рост объёма не более х10 (client/agreement/account/carry/ BS/PL/OLAP), т.е. 280 МБ при самом тяжелом случае.
        Итого: 1 Гб на этапе MVP закрывает потребности гарантированно.

*/

--------------------------------------------------------------------
-- 1. Создание базы данных
CREATE DATABASE PersonalFinance_v4
 ON  PRIMARY 
	( NAME = PF_vol, FILENAME = N'C:\DBase\PFDB4\PF_vol1.mdf' , 
		SIZE = 128MB ,--начальный размер (см. расчёт выше)
		MAXSIZE = 1Gb,--предельнное значение
		FILEGROWTH = 128MB )
 LOG ON 
	( NAME = PF_log, FILENAME =  N'C:\DBase\PFDB4\PF_log.ldf' , 
		SIZE = 100MB ,
		MAXSIZE = 1GB ,
		FILEGROWTH = 100MB )
GO

--------------------------------------------------------------------
--2. Создание таблиц

USE PersonalFinance_v4;
GO
--создание схем
--схема для загрузки и подготовки данных
CREATE Schema STAGE;
GO
--основная рабочая схема, хранение, расчёты
CREATE Schema Accounting;
GO
--схема для отчётов, пользовательских витрин, кубов
CREATE Schema Reports;
GO
