ACCOUNTING.CALC_BS
	--расчёт баланса
	--берем баланс за предыдущий период
	собираем fpnl за текущйи период
	складываем - записываем итоговый баланс
	предварительно сторнируем предыдущую запись баланса за текущий период... или если период не закрыт?
	сторнируем незакрытый перод
	каждый расчет увеличивает таблицу

get_FBS
--выборка баланса за период
--можно включить фильтр счетов, можно не включать
	select *
	from Accounting.dm_rest src
	where
		src.id_period = ...


get_FPNL
	select *
	from Accounting.FCT_CARRY src
	where src.carry_date between ...
		and id_type = 1--только бухданные пока
	group by --группируем по чем-нибудь, напримет отбрасываем догвооры и клиентов (он один), оставляем счета
	--подтянуть наименования счетов


	секционирование  на примерепроводок
	секции по периодам, для примера по месяцам (объемы данных) или годам? не успеем собрать данные

	подключить генераторы и сборщики вайба
